#+TITLE: symdon-ring
#+STARTUP: indent hidestars inlineimages

A Clojure library designed to ... well, that part is up to you.

* Build executable jar file

#+BEGIN_SRC shell :results scalar
lein uberjar
#+END_SRC

#+RESULTS:
: Created /srv/symdon-ga/symdon-ring/target/symdon-ring-0.1.0-SNAPSHOT.jar
: Created /srv/symdon-ga/symdon-ring/target/symdon-ring-0.1.0-SNAPSHOT-standalone.jar

* Execute uberjar

#+BEGIN_SRC shell :results scalar
java -jar target/symdon-ring-0.1.0-SNAPSHOT-standalone.jar
#+END_SRC

#+RESULTS:
: Hello, World!

* Usage

FIXME

** License

Copyright © 2019 FIXME

This program and the accompanying materials are made available under the
terms of the Eclipse Public License 2.0 which is available at
http://www.eclipse.org/legal/epl-2.0.

This Source Code may also be made available under the following Secondary
Licenses when the conditions for such availability set forth in the Eclipse
Public License, v. 2.0 are satisfied: GNU General Public License as published by
the Free Software Foundation, either version 2 of the License, or (at your
option) any later version, with the GNU Classpath Exception which is available
at https://www.gnu.org/software/classpath/license.html.
